# StructuralMaterialType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralMaterialTypeFilter..::..StructuralMaterialType Property
StructuralMaterialTypeFilter Class See Also
---
The structural material type.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public StructuralMaterialType StructuralMaterialType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StructuralMaterialType As StructuralMaterialType
	Get
```

Visual C++
---
```text
public:
property StructuralMaterialType StructuralMaterialType {
	StructuralMaterialType get ();
}
```

# See Also
StructuralMaterialTypeFilter Class
Autodesk.Revit.DB.Structure Namespace